InventoriLab/app/Controllers/Barang.php

SELECT *
FROM `kategori`
SELECT *
FROM `satuan`
---
    public function tambah(){
        $modelkategori = new Modelkategori();
        $modelsatuan = new Modelsatuan();

        $data = [
            'datakategori' => $modelkategori->findAll(),
            'datasatuan' => $modelsatuan->findAll(),
        ];