InventoriLab/app/Controllers/Kategori.php

SELECT *
FROM `kategori`
 LIMIT 5, 5
SELECT COUNT(*) AS `numrows`
FROM `kategori`
---
    public function index()
    {
        $tombolcari = $this->request->getPost('tombolcari');
        if (isset($tombolcari)) {
            $cari = $this->request->getPost('cari');
            session()->set('cari_kategori', $cari);
            redirect()->to('/kategori/index');
        }else{
            $cari = session()->get('cari_kategori');
        }

        $dataKategori = $cari ? $this->kategori->cariData($cari)->paginate(5, 'kategori') : $this->kategori->paginate(5, 'kategori');

INSERT INTO `kategori` (`katnama`) VALUES ('Pc')
---
    public function simpandata(){
        $namakategori = $this->request->getVar('namakategori');

        $validation = \Config\Services::validation();

        $valid = $this-> validate([
            'namakategori' => [
                'rules' => 'required',
                'label' => 'Nama Kategori',
                'error' =>[
                    'required' => '{field} tidakboleh kosong'
                ]
                ]
        ]);

        if(!$valid){
            $pesan = [
                'errorNamaKategori' => '<br><div class="alert alert-danger">' . $validation->getError() . '</div>'
            ];
            session()->setFlashdata($pesan);
            return redirect()->to('/kategori/formtambah');
        }else{
            $this->kategori->insert([
                'katnama' => $namakategori
            ]);

SELECT *
FROM `kategori`
WHERE `kategori`.`katid` = '1'
---
    public function formedit($id) {
        $rowData = $this->kategori->find($id);

UPDATE `kategori` SET `katnama` = 'Komputer'
WHERE `kategori`.`katid` IN ('6')
---
    public function updatedata(){
        $idkategori = $this->request->getVar('idkategori');
        $namakategori = $this->request->getVar('namakategori');

        $validation = \Config\Services::validation();

        $valid = $this-> validate([
            'namakategori' => [
                'rules' => 'required',
                'label' => 'Nama Kategori',
                'error' =>[
                    'required' => '{field} tidakboleh kosong'
                ]
                ]
        ]);

        if(!$valid){
            $pesan = [
                'errorNamaKategori' => '<br><div class="alert alert-danger">' . $validation->getError() . '</div>'
            ];
            session()->setFlashdata($pesan);
            return redirect()->to('/kategori/formedit/'.$idkategori);
        }else{
            $this->kategori->update($idkategori, [
                'katnama' => $namakategori
            ]);